Test_case/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel Newtonian;

cold_temp      288.15;

// Laminar viscosity
nu nu [0 2 -1 0 0 0 0]  3.18e-6;

// Thermal expansion coefficient
beta [0 0 0 -1 0 0 0]     3.69e-4;

// Reference temperature
TRef [0 0 0 1 0 0 0] $cold_temp; 

// Laminar Prandtl number
Pr [0 0 0 0 0 0 0] 26.4; //5.977885;

// Turbulent Prandtl number (not used)
Prt [0 0 0 0 0 0 0] 0.7;

// Rotational rate [rad/s] 
av_omega av_omega [0 0 -1 0 0 0 0] ( 0 0 1.6263);

// ************************************************************************* //
