Test_case/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver          GAMG;
        preconditioner  DIC;
        smoother        DIC;
        tolerance       1e-10;
        relTol          0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    "(T|k|epsilon)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.01;
    }

    U
    {
        type            coupled;      
        solver          PBiCCCG; //PBiCG; //PBiCCCG; //PBiCGStab;
        preconditioner  DILU;
        tolerance       (1e-12 1e-12 1e-12);
        relTol          (0.05 0.05 0.05);
    }

    "(T|k|epsilon)Final"
    {
        $T;
        relTol          0;
    }

    UFinal
    {
        $U;
        relTol (0 0 0);        
    }
}

PIMPLE
{
    momentumPredictor yes;
    nNonOrthogonalCorrectors 0;
    nCorrectors       3;
    nOuterCorrectors  50;
    pRefCell          0;
    pRefValue         0;
    consistent yes;

    residualControl
    {
        U
        {
               tolerance  1e-8;
               relTol     0;

        }
        p_rgh
        {
                tolerance  1e-8;
                relTol      0;
        }
        T
        {
    	        tolerance  1e-8;
                relTol      0;
	}
    }
}

relaxationFactors
{
    fields
    {
        p_rgh            1;
        p_rghFinal       1;
    }
    equations
    {
        "U|k|epsilon"    1;
          T	         1;
    }
}


// ************************************************************************* //
