Test_case/system/internalCloud
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v2012
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields interpolated to a specified cloud of points.

\*---------------------------------------------------------------------------*/
    cloud
    {
        type            sets;
        libs            ("libsampling.so");
        
        executeControl  writeTime;
        writeControl    timeStep;

        interpolationScheme     cellPoint;
        setFormat       raw;   
        fields (T U);     
        sets
        (
            cloud
            {
                type    cloud;
                axis    xyz;
                points
                (
                    (	0.0525	0	0.07	)
                    (	0.051491227	0.010242242	0.07	)
                    (	0.048503675	0.02009088	0.07	)
                    (	0.043652155	0.029167437	0.07	)
                    (	0.037123106	0.037123106	0.07	)
                    (	0.029167437	0.043652155	0.07	)
                    (	0.02009088	0.048503675	0.07	)
                    (	0.010242242	0.051491227	0.07	)
                    (	3.21601E-18	0.0525	0.07	)
                    (	-0.010242242	0.051491227	0.07	)
                    (	-0.02009088	0.048503675	0.07	)
                    (	-0.029167437	0.043652155	0.07	)
                    (	-0.037123106	0.037123106	0.07	)
                    (	-0.043652155	0.029167437	0.07	)
                    (	-0.048503675	0.02009088	0.07	)
                    (	-0.051491227	0.010242242	0.07	)
                    (	-0.0525	6.43203E-18	0.07	)
                    (	-0.051491227	-0.010242242	0.07	)
                    (	-0.048503675	-0.02009088	0.07	)
                    (	-0.043652155	-0.029167437	0.07	)
                    (	-0.037123106	-0.037123106	0.07	)
                    (	-0.029167437	-0.043652155	0.07	)
                    (	-0.02009088	-0.048503675	0.07	)
                    (	-0.010242242	-0.051491227	0.07	)
                    (	-9.64804E-18	-0.0525	0.07	)
                    (	0.010242242	-0.051491227	0.07	)
                    (	0.02009088	-0.048503675	0.07	)
                    (	0.029167437	-0.043652155	0.07	)
                    (	0.037123106	-0.037123106	0.07	)
                    (	0.043652155	-0.029167437	0.07	)
                    (	0.048503675	-0.02009088	0.07	)
                    (	0.051491227	-0.010242242	0.07	)
                );
            }
        );
    }
// ************************************************************************* //
