Test_case/system/residuals
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    For specified fields, writes out the initial residuals for the first
    solution of each time step; for non-scalar fields (e.g. vectors), writes
    the largest of the residuals for each component (e.g. x, y, z).

\*---------------------------------------------------------------------------*/

//#includeEtc "caseDicts/postProcessing/numerical/residuals.cfg"
type            solverInfo;
libs            ("libutilityFunctionObjects.so");

writeControl    timeStep;
writeInterval   1;
fields (U T p_rgh);

// ************************************************************************* //
